1.更新匯率及餘額C及餘額D	
2.更新外幣債評估表:以複製貼上值方式更新	
3.更新債券評價表-AC-AI601(至OM下載：OM->固定收益->債券->報表->債券評價表 for 匯出檔案，選取真正月底日)	
4.更新票券評價表-AC-AI601(至OM下載：OM->固定收益->債券->報表->票券評價表 for 匯出檔案，選取真正月底日)	
5.AI601：	1.確認是否需要更新轉投資部位成本(儲存格S22~S26)
   	2.確認是否有新增交易商品,需於儲存格P欄至U欄新增會科資料,並於AI601申報欄位中填作對應分類
	3.更新不動產投資數額,儲存格C52~H55(總務提供)
	4.確認更新下方附表藍色欄位手動輸入資料(AC投資及評價及TLAC標的)
	5.確認自表檢核欄位是否為OK(儲存格O欄)
	6.核對74-1相關欄位是否一致
	7.需注意 I78 欄位之票券及債券評價加總正確欄位
6.檢核:確認檢核表檢核欄位是否皆正確	


匯率
餘額C
餘額D	
外幣債評估表
債券評價表
票券評價表






- 公債
    - FVPL (中央+地方)
        - FVPL -中央b
        120050101
        - FVPL -地方
        120050103
        - FVOCI -中央
        121110101
        - FVOCI -地方
        121110103


    - FVOCI (中央+地方)
    - AC -中央
    122010101
    - AC -地方
    122010103

- 公司債
    - FVPL -公營
    120050121
    - FVPL -公營評價
    120070121
    - FVPL -民營
    120050123
    - FVPL -民營評價
    120070123



- 股權

股權	高鐵		
	財金公司		=8580000+782542+858924
	台灣金聯		60000000
	台灣金融		50000000
	台灣集保		6104772
	陽光AMC+行動支付		=154280+3000000
	華泰保險經紀		0


- 股票
    - FVPL -上市
    120050301
    - FVPL -上市-特別股
    120050311
    - FVPL -上櫃
    120050302
    - FVOCI -上市
    121010301
    - FVOCI -上櫃
    121010302


- 受益憑證
    - 新光敦南
    - 玉山CBO-A2

- 公司債
    - CB
    120057307
    - FVOCI 
        - FVOCI -公營
        121110121
        - FVOCI -民營
        121110123
    - AC 
        - AC -公營
        122010121
        - AC -民營
        122010123
    - FVPL
        - FVPL -公營
        120050121
        - FVPL -民營
        120050123

- 金融債券
    - 94安泰5

- 央行NCD
    - FVOCI 
    121110911
    - AC
    122010911


- FVPL 目的金融資產
    - 受益憑證
        - 帳面	120050501
        - 評價	120070501
    - 公債
        - 評價
            FVPL -中央	120070101
            FVPL -地方	120070103
    - 股票
        帳面-上市	
        帳面-上櫃	
        帳面-特別股	
        評價-上市	120070301
        評價-上櫃	120070302
        評價-特別股	120070311


- FVOCI 出售金融資產
    - 股票(FVOCI 股票不能投資上櫃)
        帳面-上市-金融	
        帳面-上市-非金	
        帳面-上櫃-金融	
        帳面-上櫃-非金	
        評價-上市	121030301
        評價-上櫃	
    - "股票-其他轉投資等六家"
        帳面	121019901
	    評價	121039901
    - 央行NCD
        帳面	121110911
        評價	121130911
        AC帳面	122010911

    - 公債
        - 帳面
	    - 評價
            FVOCI -中央	121130101
            FVOCI -地方	121130103

    - 公司債
        公營帳面	121110121
        民營帳面	121110123
        公營評價	121130121
        民營評價	121130123
    - 權益法
        帳面	15001
        評價	15003

    - 資產交換CB
        帳面	120057307
        評價	120077307
        減損	120079031

    附買回票券及債券負債-公債 		225010101
    附買回票券及債券負債-公司債 		225010105

- 外幣債(金融債)-FVOCI 
    - "金融債一般"
        帳面	121110147
        評價	121130147

- 商業本票
    - FVPL 目的
        帳面	120050903
        評價	120070903
- 外幣債(公司債)-FVOCI 
    - "公司債一般"
        公營帳面	121110125
        公營評價	121130125
        民營帳面	121110127
        民營評價	121130127
- 外幣債(中央公債)-FVPL
    - 中央公債
        帳面	120050105
        評價	120070105
            
- 外幣債(中央公債)-FVOCI 
    - 中央公債
        帳面	121110105
        評價	121130105
- 外幣債(中央公債)-AC
    - 中央公債
        帳面	122010105
	    評價	


- 外幣債(公司債)-AC
    - 公司債
        公營帳面	122010125
        民營帳面	122010127

- 外幣債(金融債)-AC 
    - "金融債一般"
        帳面	122010147
    - "金融債次順位"
        帳面	
    - "金融債其他"
        帳面	
- 外幣債(金融債)-FVPL 目的
    "金融債一般"
        帳面	120050147
        評價	120070147
- AC 債務工具累計減損
    AC 中央公債		122030101
    AC 地方公債		122030103
    AC 中央公債-外國		122030105
    AC 公營公司債		122030121
    AC 民營公司債		122030123
    AC 公營公司債(外幣)		122030125
    AC 民營公司債(外幣)		122030127
    AC 金融債(外幣)		122030147
    AC 央行NCD		122030911
- FVOCI債務工具累計減損
    FVOCI債務備抵損失-公債-中央政府(我國)             		325350101
    FVOCI債務備抵損失-公債-地方政府(我國)             		325350103
    FVOCI債務備抵損失-公債-中央政府(外國)             		325350105
    FVOCI債務備抵損失-普通公司債(公營)                		325350121
    FVOCI債務備抵損失-普通公司債(民營)                		325350123
    FVOCI債務備抵損失-普通公司債(公營)(外國)          		325350125
    FVOCI債務備抵損失-普通公司債(民營)(外國)          		325350127
    FVOCI債務備抵損失-金融債券-海外                   		325350129
    FVOCI債務備抵損失-央行NCD                         		325350911

- 外幣債(公司債)-FVPL
    "公司債一般"
        公營帳面	120050125
        公營評價	120070125
        民營帳面	120050127
        民營評價	120070127



六、投資於「大陸地區交易所掛牌上市之陸股」原始取得成本。(9060)
=I74

四、㈠投資於「大陸地區交易所掛牌上市之陸股」公允價值。(9061)
0

七 、投資於國內上市、上櫃 股票原始取得成本。(9070)
=SUM(S62:S64)+SUM(S72:S75)

七 、㈠投資於國內上市、上櫃 股票公允價值。(9071)
=SUM(S62:S67)+SUM(S72:S77)

八、按攤銷後成本衡量之債務工具投資帳列金額。(9080)
=L9

       ㈠按攤銷後成本衡量之債務工具投資公允價值。(9081)
='債券評價表-AC-AI601'!P23+'票券評價表-AC-AI601'!S35+(SUMIF(外幣債評估表!I:I,"小計2",外幣債評估表!K:K)+SUMIF(外幣債評估表!I:I,"小計2",外幣債評估表!L:L))*匯率!D13+S50

九、投資於 AT1債券 （Additional Tier 1 Capital Bond）原始取得成本。(9090)
0

         ㈠投資於AT1債券（Additional Tier 1 Capital Bond）公允價值。(9091)
0

十、投資於TLAC債券 ( Total Loss Absorbing Capacity Bond)原始取得成本。(9100)
=ROUND(SUMIF(外幣債評估表!V:V,"Y",外幣債評估表!K:K)*匯率!D13,0)

        ㈠投資於TLAC債券( Total Loss Absorbing Capacity Bond)公允價值。(9101)
=ROUND((SUMIF(外幣債評估表!V:V,"Y",外幣債評估表!K:K)+SUMIF(外幣債評估表!V:V,"Y",外幣債評估表!L:L))*匯率!D13,0)




AI601		
		
- 公債		
    - FVPL (中央+地方)		
- FVPL -中央b		
120050101   強制FVPL金融資產-公債-中央政府(我國)              
- FVPL -地方		
120050103   強制FVPL金融資產-公債-地方政府(我國)              
- FVOCI -中央		
121110101   FVOCI債務工具-公債-中央政府(我國)                 
- FVOCI -地方		
121110103   FVOCI債務工具-公債-地方政府(我國)                 
		
- FVOCI (中央+地方)		
- AC -中央		
122010101   AC債務工具投資-公債-中央政府(我國)                
- AC -地方		
122010103   AC債務工具投資-公債-地方政府(我國)                
		
- 公司債		
- FVPL -公營		
120050121   強制FVPL金融資產-普通公司債(公營)                 
- FVPL -公營評價		
120070121   強制FVPL金融資產評價調整-普通公司債(公營)         
- FVPL -民營		
120050123   強制FVPL金融資產-普通公司債(民營)                 
- FVPL -民營評價		
120070123   強制FVPL金融資產評價調整-普通公司債(民營)         
		
- 股權		
		
- 股票		
- FVPL -上市		
120050301   強制FVPL金融資產-普通股-上市公司                  
- FVPL -上市-特別股		
120050311   強制FVPL金融資產-特別股-上市                      
- FVPL -上櫃		
120050302   強制FVPL金融資產-普通股-上櫃公司                  
- FVOCI -上市		
121010301   FVOCI權益工具-普通股-上市公司                     
- FVOCI -上櫃		
121010302   FVOCI權益工具-普通股-上櫃公司                     
		
- 公司債		
- CB		
120057307   強制FVPL金融資產-衍生性ＳＷＡＰ-ASS               
- FVOCI 		
- FVOCI -公營		
121110121   FVOCI債務工具-普通公司債（公營）                  
- FVOCI -民營		
121110123   FVOCI債務工具-普通公司債（民營）                  
- AC 		
- AC -公營		
122010121   AC債務工具投資-普通公司債(公營)                   
- AC -民營		
122010123   AC債務工具投資-普通公司債(民營)                   
- FVPL		
- FVPL -公營		
120050121   強制FVPL金融資產-普通公司債(公營)                 
- FVPL -民營		
120050123   強制FVPL金融資產-普通公司債(民營)                 
		
- 央行NCD		
- FVOCI 		
121110911   FVOCI債務工具-央行NCD                             
- AC		
122010911   AC債務工具投資-央行NCD                            
		
- FVPL 目的金融資產		
    - 受益憑證		
- 帳面		
120050501   強制FVPL金融資產-受益憑證                         
- 評價		
120070501   強制FVPL金融資產評價調整-受益憑證                 
    - 公債		
        - 評價		
FVPL -中央		
120070101   強制FVPL金融資產評價調整-公債-中央(我國)          
FVPL -地方		
120070103   強制FVPL金融資產評價調整-公債-地方(我國)          
    - 股票		
        帳面-上市   		
        帳面-上櫃   		
        帳面-特別股  		
評價-上市		
120070301   強制FVPL金融資產評價調整-上市公司                 
評價-上櫃		
120070302   強制FVPL金融資產評價調整-上櫃公司                 
評價-特別股		
120070311   強制FVPL金融資產評價調整-特別股-上市              
		
		
- FVOCI 出售金融資產		
    - 股票(FVOCI 股票不能投資上櫃)		
        帳面-上市-金融    		
        帳面-上市-非金    		
        帳面-上櫃-金融    		
        帳面-上櫃-非金    		
評價-上市		
121030301   FVOCI權益工具評價調整-普通股-上市                 
        評價-上櫃   		
    - "股票-其他轉投資等六家"		
帳面		
121019901   FVOCI權益工具-其他                                
評價		
121039901   FVOCI權益工具評價調整-其他                        
    - 央行NCD		
帳面		
121110911   FVOCI債務工具-央行NCD                             
評價		
121130911   FVOCI債務工具評價調整-央行NCD                     
AC帳面		
122010911   AC債務工具投資-央行NCD                            
		
    - 公債		
        - 帳面		
        - 評價		
FVOCI -中央		
121130101   FVOCI債務工具評價調整-公債-中央政府               
FVOCI -地方		
121130103   FVOCI債務工具評價調整-公債-地方政府               
		
    - 公司債		
公營帳面		
121110121   FVOCI債務工具-普通公司債（公營）                  
民營帳面		
121110123   FVOCI債務工具-普通公司債（民營）                  
公營評價		
121130121   FVOCI債務工具評價調整-普通公司債（公營)           
民營評價		
121130123   FVOCI債務工具評價調整-普通公司債（民營)           
    - 權益法		
帳面		
15001   採用權益法之投資成本                              
評價		
15003   加（減）：採用權益法認列之投資權益調整            
		
    - 資產交換CB		
帳面		
120057307   強制FVPL金融資產-衍生性ＳＷＡＰ-ASS               
評價		
120077307   強制FVPL金融資產評價調整-ＳＷＡＰ-ASS             
減損		
120079031   強制FVPL金融資產評價調整-CVA-SWAP-ASS             
		
附買回票券及債券負債-公債   		
225010101   附買回票券及債券負債-公債                         
附買回票券及債券負債-公司債		
225010105   附買回票券及債券負債-公司債                       
		
- 外幣債(金融債)-FVOCI 		
    - "金融債一般"		
帳面		
121110147   FVOCI債務工具-金融債券-海外                       
評價		
121130147   FVOCI債務工具評價調整-金融債券-海外               
		
- 商業本票		
    - FVPL 目的		
帳面		
120050903   強制FVPL金融資產-商業本票                         
評價		
120070903   強制FVPL金融資產評價調整-商業本票                 
- 外幣債(公司債)-FVOCI 		
    - "公司債一般"		
公營帳面		
121110125   FVOCI債務工具-普通公司債(公營)(外國)              
公營評價		
121130125   FVOCI債務工具評價調整-普通公司債(公營)(外國)      
民營帳面		
121110127   FVOCI債務工具-普通公司債(民營)(外國)              
民營評價		
121130127   FVOCI債務工具評價調整-普通公司債(民營)(外國)      
- 外幣債(中央公債)-FVPL		
    - 中央公債		
帳面		
120050105   強制FVPL金融資產-公債-中央政府(外國)              
評價		
120070105   強制FVPL金融資產評價調整-公債-中央-外國           
            		
- 外幣債(中央公債)-FVOCI 		
    - 中央公債		
帳面		
121110105   FVOCI債務工具-公債-中央政府(外國)                 
評價		
121130105   FVOCI債務工具評價調整-公債-中央政府(外國)         
- 外幣債(中央公債)-AC		
    - 中央公債		
帳面		
122010105   AC債務工具投資-公債-中央政府(外國)                
        評價  		
		
		
- 外幣債(公司債)-AC		
    - 公司債		
公營帳面		
122010125   AC債務工具投資-普通公司債(公營)(外國)             
民營帳面		
122010127   AC債務工具投資-普通公司債(民營)(外國)             
		
- 外幣債(金融債)-AC 		
    - "金融債一般"		
帳面		
122010147   AC債務工具投資-金融債券-海外                      
    - "金融債次順位"		
        帳面  		
    - "金融債其他"		
        帳面  		
- 外幣債(金融債)-FVPL 目的		
    "金融債一般"		
帳面		
120050147   #N/A
評價		
120070147   #N/A
- AC 債務工具累計減損		
AC 中央公債 		
122030101   累積減損-AC債務工具投資-公債-中央                 
AC 地方公債 		
122030103   累積減損-AC債務工具投資-公債-地方                 
AC 中央公債-外國		
122030105   累積減損-AC債務工具投資-公債-中央政府(外國)       
AC 公營公司債    		
122030121   累積減損-累積減損-AC債務工具投資-普通公司(公營)   
AC 民營公司債    		
122030123   累積減損-AC債務工具投資-普通公司(民營)            
AC 公營公司債(外幣)    		
122030125   累積減損-AC債務工具投資-普通公司(公營)(外國)      
AC 民營公司債(外幣)        		
122030127   累積減損-AC債務工具投資-普通公司(民營)(外國)      
AC 金融債(外幣)      		
122030147   累積減損-AC債務工具投資-金融債券-海外             
AC 央行NCD        		
122030911   累積減損-AC債務工具投資-央行NCD                   
- FVOCI債務工具累計減損		
FVOCI債務備抵損失-公債-中央政府(我國)                     		
325350101   FVOCI債務備抵損失-公債-中央政府(我國)             
FVOCI債務備抵損失-公債-地方政府(我國)                     		
325350103   FVOCI債務備抵損失-公債-地方政府(我國)             
FVOCI債務備抵損失-公債-中央政府(外國)                     		
325350105   FVOCI債務備抵損失-公債-中央政府(外國)             
FVOCI債務備抵損失-普通公司債(公營)                       		
325350121   FVOCI債務備抵損失-普通公司債(公營)                
FVOCI債務備抵損失-普通公司債(民營)                       		
325350123   FVOCI債務備抵損失-普通公司債(民營)                
FVOCI債務備抵損失-普通公司債(公營)(外國)               		
325350125   FVOCI債務備抵損失-普通公司債(公營)(外國)          
FVOCI債務備抵損失-普通公司債(民營)(外國)               		
325350127   FVOCI債務備抵損失-普通公司債(民營)(外國)          
FVOCI債務備抵損失-金融債券-海外                         		
325350129   FVOCI債務備抵損失-金融債券-海外                   
FVOCI債務備抵損失-央行NCD                               		
325350911   FVOCI債務備抵損失-央行NCD                         
		
- 外幣債(公司債)-FVPL		
    "公司債一般"		
公營帳面    		
120050125   強制FVPL金融資產-普通公司債(公營)(外國)           
公營評價    		
120070125   強制FVPL金融資產評價調整-普通公司債(公營)(外國)   
民營帳面    		
120050127   強制FVPL金融資產-普通公司債(民營)(外國)           
民營評價    		
120070127   強制FVPL金融資產評價調整-普通公司債(民營)(外國)   
		


PARAMETERS DataMonthParam TEXT;
SELECT
    AccountCodeMap.AssetMeasurementSubType & "_" & AccountCodeMap.Category As MeasurementCategory,
    SUM(ab.Amount) As SubtotalAmount
FROM AccountCodeMap
INNER JOIN
    (
        SELECT AccountBalance.AccountCode, AccountBalance.Amount
        FROM AccountBalance
        WHERE AccountBalance.DataMonthString = [DataMonthParam]
        AND AccountBalance.BalanceType = '餘額C'
    ) AS ab
ON
    AccountCodeMap.AccountCode = ab.AccountCode
WHERE
    AccountCodeMap.GroupFlag IN ('台幣債', '股權', '受益憑證', 'CP', 'Derivative', 'Bill')
    AND AccountCodeMap.Category IN ('Cost' , 'ValuationAdjust', 'ImpairmentLoss', 'ImpairmentAllowance')
    AND AccountCodeMap.SingleOrSubtotal = 'Single'
GROUP BY
    AccountCodeMap.AssetMeasurementType,
    AccountCodeMap.AssetMeasurementSubType,
    AccountCodeMap.Category;
