銀                行	001				0 												0 	0 
中華郵政儲匯處	013																0 	0 
農漁會信用部	011																0 	0 
信      合      社	012																0 	0 
票券金融公司	002														
保   險  公   司4	004																0 	0 
公   營  事   業	005																0 	0 
民   營  企   業	006				0 												0 	0 
個                人	009																0 	0 
政   府  機   關5	014																0 	0 
社會保險、退休基金及非營利團體6	015																0 	0 


"交  易  性
商業本票"		融  資  性                           商業本票		"銀行可轉讓2定 期 存 單
 (含新台幣及外幣)"		銀行承兌                         匯    票		商業承兌                         匯    票		國 庫 券		其他短期3                         債務憑證		合      計	
買進	賣出	買進	賣出	買進	賣出	買進	賣出	買進	賣出	買進	賣出	買進	賣出	買進	賣出
