-- ==================================================		
		
table10		
		
1.公債		
原始取得成本1		
120050101   強制FVPL金融資產-公債-中央政府(我國)              
120050103   強制FVPL金融資產-公債-地方政府(我國)              
121110101	FVOCI債務工具-公債-中央政府(我國)                 
121110103	FVOCI債務工具-公債-地方政府(我國)                 
122010101	AC債務工具投資-公債-中央政府(我國)                
122010103	AC債務工具投資-公債-地方政府(我國)                
		
透過損益按公允價值衡量之金融資產2 A		
120050101	強制FVPL金融資產-公債-中央政府(我國)              
120050103	強制FVPL金融資產-公債-地方政府(我國)

120070101	強制FVPL金融資產評價調整-公債-中央(我國)          
120070103	強制FVPL金融資產評價調整-公債-地方(我國)          
		
透過其他綜合損益按公允價值衡量之金融資產2 B		
121110101	FVOCI債務工具-公債-中央政府(我國)                 
121110103	FVOCI債務工具-公債-地方政府(我國)                 

121130101	FVOCI債務工具評價調整-公債-中央政府               
121130103	FVOCI債務工具評價調整-公債-地方政府               
		
按攤銷後成本衡量之債務工具投資2 C		
122010101	AC債務工具投資-公債-中央政府(我國)                
122010103	AC債務工具投資-公債-地方政府(我國)   

122030101	累積減損-AC債務工具投資-公債-中央                 
122030103	累積減損-AC債務工具投資-公債-地方                 
		
		
2.公司債		
2.1.公營事業		
    原始取得成本1		
120050121	強制FVPL金融資產-普通公司債(公營)                 
121110121	FVOCI債務工具-普通公司債（公營）                  
122010121	AC債務工具投資-普通公司債(公營)                   
		
    透過損益按公允價值衡量之金融資產2 A		
120050121	強制FVPL金融資產-普通公司債(公營)                 

120070121	強制FVPL金融資產評價調整-普通公司債(公營)         
		
    透過其他綜合損益按公允價值衡量之金融資產2 B		
121110121	FVOCI債務工具-普通公司債（公營）                  
		
    按攤銷後成本衡量之債務工具投資2 C		
122010121	AC債務工具投資-通公司債(公營)                   
		
2.2.民營企業-國內公司債		普


    原始取得成本1		
120050123	強制FVPL金融資產-普通公司債(民營)                 
121110123	FVOCI債務工具-普通公司債（民營）                  
122010123	AC債務工具投資-普通公司債(民營)                   
		
    透過損益按公允價值衡量之金融資產2 A		
120050123	強制FVPL金融資產-普通公司債(民營)  

120070123	強制FVPL金融資產評價調整-普通公司債(民營)         
		
    透過其他綜合損益按公允價值衡量之金融資產2 B		
121110123	FVOCI債務工具-普通公司債（民營）                  
		
    按攤銷後成本衡量之債務工具投資2 C		
122010123	AC債務工具投資-普通公司債(民營)                   
		
3.股票及股權投資-民營企業		
    原始取得成本1		
1200503	強制FVPL金融資產-股票                             
1210103	FVOCI權益工具-股票                                
15501	#N/A
121019901	FVOCI權益工具-其他                                
150019901	採用權益法之股權投資成本-其他                     
		
    透過損益按公允價值衡量之金融資產2 A		
1200503 強制FVPL金融資產-股票                             
		
    透過其他綜合損益按公允價值衡量之金融資產2 B		
1210103	FVOCI權益工具-股票                                
1210303	FVOCI權益工具評價調整-股票                        

1210199	FVOCI權益工具-其他                                
1210399	FVOCI權益工具評價調整-其他                        
		
    按攤銷後成本衡量之債務工具投資2 C		
    		
    採用權益法之投資-淨額2 E		
15001	採用權益法之投資成本                              
15003	加（減）：採用權益法認列之投資權益調整            
		
4.受益憑證-其他		
		
    原始取得成本1		
1200505	強制FVPL金融資產-受益憑證                         
		
    透過損益按公允價值衡量之金融資產2 A		
1200505	強制FVPL金融資產-受益憑證                         
1200705	強制FVPL金融資產評價調整-受益憑證                 
		
    透過其他綜合損益按公允價值衡量之金融資產2 B		
		
    按攤銷後成本衡量之債務工具投資2 C		
		
5.新台幣可轉讓定期存單-中央銀行發行		
		
    原始取得成本1		
121110911	FVOCI債務工具-央行NCD                             
122010911	AC債務工具投資-央行NCD                            
		
    透過損益按公允價值衡量之金融資產2 A		
		
    透過其他綜合損益按公允價值衡量之金融資產2 B		
121110911	FVOCI債務工具-央行NCD                             
121130911	FVOCI債務工具評價調整-央行NCD                     
		
    按攤銷後成本衡量之債務工具投資2 C		
122010911	AC債務工具投資-央行NCD                            
122030911	累積減損-AC債務工具投資-央行NCD                   
		
6.商業本票-民營企業		
		
    原始取得成本1		
120050903	強制FVPL金融資產-商業本票                         
		
    透過損益按公允價值衡量之金融資產2 A		
120050903	強制FVPL金融資產-商業本票                         
120070903	強制FVPL金融資產評價調整-商業本票                 
		
    透過其他綜合損益按公允價值衡量之金融資產2 B		
		
    按攤銷後成本衡量之債務工具投資2 C		
		
7.國外機構發行-在國外發行-長期債票券6		
		
    原始取得成本1		
140010147	備供出售-金融債券-海外                            
		
    透過損益按公允價值衡量之金融資產2 A		
		
    透過其他綜合損益按公允價值衡量之金融資產2 B		
140010147	備供出售-金融債券-海外                            
140030147	備供出售評價調整-金融債券-海外                    
		
    按攤銷後成本衡量之債務工具投資2 C		
		
table20		
- 民營企業		
    - 其他到期日		
        - 公債		
225010101	附買回票券及債券負債-公債                         
        - 公司債		
225010105	附買回票券及債券負債-公司債                       
        - 商業本票		
225010303   #N/A
		
-- =====================		
table40		
		
- 台幣數字		
    - 衍生性金融資產		
        - 國內		
            - 強制透過損益按公允價值衡量之金融資產2		
                - 成本 A		
120057307	強制FVPL金融資產-衍生性ＳＷＡＰ-ASS               
                - 公允價值6 B		
120057307	強制FVPL金融資產-衍生性ＳＷＡＰ-ASS               
120077307	強制FVPL金融資產評價調整-ＳＷＡＰ-ASS             
120079031	強制FVPL金融資產評價調整-CVA-SWAP-ASS             
            - 避險之金融資產4		
                - 成本 A		
                - 公允價值6 B		
        - OBU		
            - 強制透過損益按公允價值衡量之金融資產2		
                - 成本 A		
                - 公允價值6 B		
            - 避險之金融資產4		
                - 成本 A		
                - 公允價值6 B		
        - 國外		
            - 強制透過損益按公允價值衡量之金融資產2		
                - 成本 A		
                - 公允價值6 B		
            - 避險之金融資產4		
                - 成本 A		
                - 公允價值6 B		
    - 衍生性金融負債		
        - 國內		
            - 持有供交易之金融負債3		
                - 成本 A		
                - 公允價值6 B		
            - 避險之金融負債5		
                - 成本 A		
                - 公允價值6 B		
        - OBU		
            - 持有供交易之金融負債3		
                - 成本 A		
                - 公允價值6 B		
            - 避險之金融負債5		
                - 成本 A		
                - 公允價值6 B		
        - 國外		
            - 持有供交易之金融負債3		
                - 成本 A		
                - 公允價值6 B		
            - 避險之金融負債5		
                - 成本 A		
                - 公允價值6 B        		
- 外幣數字		
    - 衍生性金融資產		
        - 國內		
            - 強制透過損益按公允價值衡量之金融資產2		
                - 成本 A		
                - 公允價值6 B		
1200771 強制FVPL金融資產評價調整-衍生性                   
            - 避險之金融資產4		
                - 成本 A		
                - 公允價值6 B		
        - OBU		
            - 強制透過損益按公允價值衡量之金融資產2		
                - 成本 A		
                - 公允價值6 B		
            - 避險之金融資產4		
                - 成本 A		
                - 公允價值6 B		
        - 國外		
            - 強制透過損益按公允價值衡量之金融資產2		
                - 成本 A		
                - 公允價值6 B		
            - 避險之金融資產4		
                - 成本 A		
                - 公允價值6 B		
    - 衍生性金融負債		
        - 國內		
            - 持有供交易之金融負債3		
                - 成本 A		
                - 公允價值6 B		
2200371 供交易之負債評價調整-遠期                         
S28		
            - 避險之金融負債5		
                - 成本 A		
                - 公允價值6 B		
        - OBU		
            - 持有供交易之金融負債3		
                - 成本 A		
                - 公允價值6 B		
            - 避險之金融負債5		
                - 成本 A		
                - 公允價值6 B		
        - 國外		
            - 持有供交易之金融負債3		
                - 成本 A		
                - 公允價值6 B		
            - 避險之金融負債5		
                - 成本 A		
                - 公允價值6 B        		
		
-- ========================================		
ai233		
		
- 透過損益按公允價值衡量A1		
    - 投資成本		
        - 政府公債A		
120050101   強制FVPL金融資產-公債-中央政府(我國)              		
120050103   強制FVPL金融資產-公債-地方政府(我國)              		
        - 公司債B		
120050121   強制FVPL金融資產-普通公司債(公營)                 		
120050123   強制FVPL金融資產-普通公司債(民營)                 		
120057307   強制FVPL金融資產-衍生性ＳＷＡＰ-ASS               		
        - 金融債券C市                              		
        - 權益證券投資D		
120050301   強制FVPL金融資產-普通股-上市公司                  		
120050302   強制FVPL金融資產-普通股-上櫃公司                  		
120050311   強制FVPL金融資產-特別股-上        		
        - 結構型商品E		
        - 證券化商品F		
        - 其它投資部位G		
120070501   強制FVPL金融資產評價調整-受益憑證                 		
120070903   強制FVPL金融資產評價調整-商業本票                 		
        - 央行可轉讓定期存單H		
    - 帳面價值 = 投資成本 + 以下		
        - 政府公債A		
120070101   強制FVPL金融資產評價調整-公債-中央(我國)          		
120070103   強制FVPL金融資產評價調整-公債-地方(我國)                 		
        - 公司債B		
120070121   強制FVPL金融資產評價調整-普通公司債(公營)         		
120070123   強制FVPL金融資產評價調整-普通公司債(民營)         		
120077307   強制FVPL金融資產評價調整-ＳＷＡＰ-ASS             		
120079031   強制FVPL金融資產評價調整-CVA-SWAP-ASS             		
        - 金融債券C		
        - 權益證券投資D		
120070301   強制FVPL金融資產評價調整-上市公司                 		
120070302   強制FVPL金融資產評價調整-上櫃公司                 		
120070311   強制FVPL金融資產評價調整-特別股-上市                      		
        - 結構型商品E		
        - 證券化商品F		
        - 其它投資部位G		
120070501   強制FVPL金融資產評價調整-受益憑證                 		
120070903   強制FVPL金融資產評價調整-商業本票                 		
        - 央行可轉讓定期存單H		
		


-- 
120050101   強制FVPL金融資產-公債-中央政府(我國)              		
120050103   強制FVPL金融資產-公債-地方政府(我國)              		
120050121   強制FVPL金融資產-普通公司債(公營)                 		
120050123   強制FVPL金融資產-普通公司債(民營)                 		
120050301   強制FVPL金融資產-普通股-上市公司                  		
120050302   強制FVPL金融資產-普通股-上櫃公司                  		
120050311   強制FVPL金融資產-特別股-上市                      		
120050501   強制FVPL金融資產-受益憑證                         		
120050903   強制FVPL金融資產-商業本票                         		
120057307   強制FVPL金融資產-衍生性ＳＷＡＰ-ASS               		
120070101   強制FVPL金融資產評價調整-公債-中央(我國)          		
120070103   強制FVPL金融資產評價調整-公債-地方(我國)          		


120070121   強制FVPL金融資產評價調整-普通公司債(公營)         		
120070123   強制FVPL金融資產評價調整-普通公司債(民營)         		

120070301   強制FVPL金融資產評價調整-上市公司                 		
120070302   強制FVPL金融資產評價調整-上櫃公司                 		
120070311   強制FVPL金融資產評價調整-特別股-上市              		
120070501   強制FVPL金融資產評價調整-受益憑證                 		
120070903   強制FVPL金融資產評價調整-商業本票                 		
120077307   強制FVPL金融資產評價調整-ＳＷＡＰ-ASS             		
120079031   強制FVPL金融資產評價調整-CVA-SWAP-ASS             		
		
    		
- 透過其他綜合損益按公允價值衡量A6		
    - 投資成本		
        - 政府公債A		
121110101   FVOCI債務工具-公債-中央政府(我國)                 		
121110103   FVOCI債務工具-公債-地方政府(我國)                 		
        - 公司債B		
121110121   FVOCI債務工具-普通公司債（公營）                  		
121110123   FVOCI債務工具-普通公司債（民營）                  		
        - 金融債券C		
        - 權益證券投資D		
121010301   FVOCI權益工具-普通股-上市公司                     		
121010302   FVOCI權益工具-普通股-上櫃公司                     		
121019901   FVOCI權益工具-其他                                		
        - 結構型商品E		
        - 證券化商品F    		
        - 其它投資部位G		
        - 央行可轉讓定期存單H		
121110911   FVOCI債務工具-央行NCD                             		
    - 帳面價值		
        - 政府公債A		
121130101   FVOCI債務工具評價調整-公債-中央政府               		
121130103   FVOCI債務工具評價調整-公債-地方政府                       		
325350103   FVOCI債務備抵損失-公債-地方政府(我國)             		
        - 公司債B		
121130121   FVOCI債務工具評價調整-普通公司債（公營)           		
121130123   FVOCI債務工具評價調整-普通公司債（民營)                       		
325350121   FVOCI債務備抵損失-普通公司債(公營)                		
325350123   FVOCI債務備抵損失-普通公司債(民營)                		
        - 金融債券C		
        - 權益證券投資D		
121030301   FVOCI權益工具評價調整-普通股-上市                 		
121030302   FVOCI權益工具評價調整-普通股-上櫃                 		
121039901   FVOCI權益工具評價調整-其他                                		
        - 結構型商品E		
        - 證券化商品F    		
        - 其它投資部位G		
        - 央行可轉讓定期存單H		
121130911   FVOCI債務工具評價調整-央行NCD                     		
325350911   FVOCI債務備抵損失-央行NCD                         		
		
121010301   FVOCI權益工具-普通股-上市公司                     		
121010302   FVOCI權益工具-普通股-上櫃公司                     		
121019901   FVOCI權益工具-其他                                		
121110101   FVOCI債務工具-公債-中央政府(我國)                 		
121110103   FVOCI債務工具-公債-地方政府(我國)                 		
121110121   FVOCI債務工具-普通公司債（公營）                  		
121110123   FVOCI債務工具-普通公司債（民營）                  		
121110911   FVOCI債務工具-央行NCD                             		
121030301   FVOCI權益工具評價調整-普通股-上市                 		
121030302   FVOCI權益工具評價調整-普通股-上櫃                 		
121039901   FVOCI權益工具評價調整-其他                        		
121130101   FVOCI債務工具評價調整-公債-中央政府               		
121130103   FVOCI債務工具評價調整-公債-地方政府               		
121130121   FVOCI債務工具評價調整-普通公司債（公營)           		
121130123   FVOCI債務工具評價調整-普通公司債（民營)           		
121130911   FVOCI債務工具評價調整-央行NCD                     		
325350103   FVOCI債務備抵損失-公債-地方政府(我國)             		
325350121   FVOCI債務備抵損失-普通公司債(公營)                		
325350123   FVOCI債務備抵損失-普通公司債(民營)                		
325350911   FVOCI債務備抵損失-央行NCD                         		
		
    		
- 按攤銷後成本衡量A7		
    - 投資成本		
        - 政府公債A		
122010101   AC債務工具投資-公債-中央政府(我國)                		
122010103   AC債務工具投資-公債-地方政府(我國)                                		
        - 公司債B		
122010121   AC債務工具投資-普通公司債(公營)                   		
122010123   AC債務工具投資-普通公司債(民營)                                		
        - 金融債券C		
        - 權益證券投資D		
        - 結構型商品E		
        - 證券化商品F		
        - 其它投資部位G		
        - 央行可轉讓定期存單H        		
122010911   AC債務工具投資-央行NCD        		
    - 帳面價值		
        - 政府公債A		
122030101   累積減損-AC債務工具投資-公債-中央                 		
122030103   累積減損-AC債務工具投資-公債-地方                         		
        - 公司債B		
122030121   累積減損-累積減損-AC債務工具投資-普通公司(公營)   		
122030123   累積減損-AC債務工具投資-普通公司(民營)            		
        - 金融債券C		
        - 權益證券投資D		
        - 結構型商品E		
        - 證券化商品F    		
        - 其它投資部位G		
        - 央行可轉讓定期存單H		
122030911   累積減損-AC債務工具投資-央行NCD                   		
		
		
		
122010101   AC債務工具投資-公債-中央政府(我國)                		
122010103   AC債務工具投資-公債-地方政府(我國)                		
122010121   AC債務工具投資-普通公司債(公營)                   		
122010123   AC債務工具投資-普通公司債(民營)                   		
122010911   AC債務工具投資-央行NCD                            		
122030101   累積減損-AC債務工具投資-公債-中央                 		
122030103   累積減損-AC債務工具投資-公債-地方                 		
122030121   累積減損-累積減損-AC債務工具投資-普通公司(公營)   		
122030123   累積減損-AC債務工具投資-普通公司(民營)            		
122030911   累積減損-AC債務工具投資-央行NCD          		
		
		
		
		
-- =============================		
		
ai405		
		
		
- 持有餘額		
    - 政府債券		
120050101		強制FVPL金融資產-公債-中央政府(我國)              
120050103		強制FVPL金融資產-公債-地方政府(我國)              
125010101		附賣回票券及債券投資-公債                         
121110101		FVOCI債務工具-公債-中央政府(我國)                 
121110103		FVOCI債務工具-公債-地方政府(我國)                 
122010101		AC債務工具投資-公債-中央政府(我國)                
122010103		AC債務工具投資-公債-地方政府(我國)                
    - 金融債券		
122010147		AC債務工具投資-金融債券-海外                      
121110147		FVOCI債務工具-金融債券-海外                       
120050147		#N/A
		
122010147		AC債務工具投資-金融債券-海外                      
121110147		FVOCI債務工具-金融債券-海外                       
120050147		#N/A
		
    - 公司債		
120057307		強制FVPL金融資產-衍生性ＳＷＡＰ-ASS               
120050121		強制FVPL金融資產-普通公司債(公營)                 
120050123		強制FVPL金融資產-普通公司債(民營)                 
121110121		FVOCI債務工具-普通公司債（公營）                  
121110123		FVOCI債務工具-普通公司債（民營）                  
122010121		AC債務工具投資-普通公司債(公營)                   
122010123		AC債務工具投資-普通公司債(民營)                   
		
121110127		FVOCI債務工具-普通公司債(民營)(外國)              
121110127		FVOCI債務工具-普通公司債(民營)(外國)              
-- ====================================		
		
ai430		
		
- 金額		
    - 新臺幣商業本票		
        - 新臺幣融資性本票		
120050903   強制FVPL金融資產-商業本票                         
1250103 附賣回票券及債券投資-票券                         
		
S欄位 面額		
    - 央行可轉讓定期存單		
1211109 FVOCI債務工具-票券                                
1220109 AC債務工具投資-票券                               
		
		
		
-- ============================		
		
AI601		
		
- 公債		
    - FVPL (中央+地方)		
- FVPL -中央b		
120050101   強制FVPL金融資產-公債-中央政府(我國)              
- FVPL -地方		
120050103   強制FVPL金融資產-公債-地方政府(我國)              
- FVOCI -中央		
121110101   FVOCI債務工具-公債-中央政府(我國)                 
- FVOCI -地方		
121110103   FVOCI債務工具-公債-地方政府(我國)                 
		
- FVOCI (中央+地方)		
- AC -中央		
122010101   AC債務工具投資-公債-中央政府(我國)                
- AC -地方		
122010103   AC債務工具投資-公債-地方政府(我國)                
		
- 公司債		
- FVPL -公營		
120050121   強制FVPL金融資產-普通公司債(公營)                 
- FVPL -公營評價		
120070121   強制FVPL金融資產評價調整-普通公司債(公營)         
- FVPL -民營		
120050123   強制FVPL金融資產-普通公司債(民營)                 
- FVPL -民營評價		
120070123   強制FVPL金融資產評價調整-普通公司債(民營)         
		
- 股權		
		
- 股票		
- FVPL -上市		
120050301   強制FVPL金融資產-普通股-上市公司                  
- FVPL -上市-特別股		
120050311   強制FVPL金融資產-特別股-上市                      
- FVPL -上櫃		
120050302   強制FVPL金融資產-普通股-上櫃公司                  
- FVOCI -上市		
121010301   FVOCI權益工具-普通股-上市公司                     
- FVOCI -上櫃		
121010302   FVOCI權益工具-普通股-上櫃公司                     
		
- 公司債		
- CB		
120057307   強制FVPL金融資產-衍生性ＳＷＡＰ-ASS               
- FVOCI 		
- FVOCI -公營		
121110121   FVOCI債務工具-普通公司債（公營）                  
- FVOCI -民營		
121110123   FVOCI債務工具-普通公司債（民營）                  
- AC 		
- AC -公營		
122010121   AC債務工具投資-普通公司債(公營)                   
- AC -民營		
122010123   AC債務工具投資-普通公司債(民營)                   
- FVPL		
- FVPL -公營		
120050121   強制FVPL金融資產-普通公司債(公營)                 
- FVPL -民營		
120050123   強制FVPL金融資產-普通公司債(民營)                 
		
- 央行NCD		
- FVOCI 		
121110911   FVOCI債務工具-央行NCD                             
- AC		
122010911   AC債務工具投資-央行NCD                            
		
- FVPL 目的金融資產		
    - 受益憑證		
- 帳面		
120050501   強制FVPL金融資產-受益憑證                         
- 評價		
120070501   強制FVPL金融資產評價調整-受益憑證                 
    - 公債		
        - 評價		
FVPL -中央		
120070101   強制FVPL金融資產評價調整-公債-中央(我國)          
FVPL -地方		
120070103   強制FVPL金融資產評價調整-公債-地方(我國)          
    - 股票		
        帳面-上市   		
        帳面-上櫃   		
        帳面-特別股  		
評價-上市		
120070301   強制FVPL金融資產評價調整-上市公司                 
評價-上櫃		
120070302   強制FVPL金融資產評價調整-上櫃公司                 
評價-特別股		
120070311   強制FVPL金融資產評價調整-特別股-上市              
		
		
- FVOCI 出售金融資產		
    - 股票(FVOCI 股票不能投資上櫃)		
        帳面-上市-金融    		
        帳面-上市-非金    		
        帳面-上櫃-金融    		
        帳面-上櫃-非金    		
評價-上市		
121030301   FVOCI權益工具評價調整-普通股-上市                 
        評價-上櫃   		
    - "股票-其他轉投資等六家"		
帳面		
121019901   FVOCI權益工具-其他                                
評價		
121039901   FVOCI權益工具評價調整-其他                        
    - 央行NCD		
帳面		
121110911   FVOCI債務工具-央行NCD                             
評價		
121130911   FVOCI債務工具評價調整-央行NCD                     
AC帳面		
122010911   AC債務工具投資-央行NCD                            
		
    - 公債		
        - 帳面		
        - 評價		
FVOCI -中央		
121130101   FVOCI債務工具評價調整-公債-中央政府               
FVOCI -地方		
121130103   FVOCI債務工具評價調整-公債-地方政府               
		
    - 公司債		
公營帳面		
121110121   FVOCI債務工具-普通公司債（公營）                  
民營帳面		
121110123   FVOCI債務工具-普通公司債（民營）                  
公營評價		
121130121   FVOCI債務工具評價調整-普通公司債（公營)           
民營評價		
121130123   FVOCI債務工具評價調整-普通公司債（民營)           
    - 權益法		
帳面		
15001   採用權益法之投資成本                              
評價		
15003   加（減）：採用權益法認列之投資權益調整            
		
    - 資產交換CB		
帳面		
120057307   強制FVPL金融資產-衍生性ＳＷＡＰ-ASS               
評價		
120077307   強制FVPL金融資產評價調整-ＳＷＡＰ-ASS             
減損		
120079031   強制FVPL金融資產評價調整-CVA-SWAP-ASS             
		
附買回票券及債券負債-公債   		
225010101   附買回票券及債券負債-公債                         
附買回票券及債券負債-公司債		
225010105   附買回票券及債券負債-公司債                       
		
- 外幣債(金融債)-FVOCI 		
    - "金融債一般"		
帳面		
121110147   FVOCI債務工具-金融債券-海外                       
評價		
121130147   FVOCI債務工具評價調整-金融債券-海外               
		
- 商業本票		
    - FVPL 目的		
帳面		
120050903   強制FVPL金融資產-商業本票                         
評價		
120070903   強制FVPL金融資產評價調整-商業本票                 
- 外幣債(公司債)-FVOCI 		
    - "公司債一般"		
公營帳面		
121110125   FVOCI債務工具-普通公司債(公營)(外國)              
公營評價		
121130125   FVOCI債務工具評價調整-普通公司債(公營)(外國)      
民營帳面		
121110127   FVOCI債務工具-普通公司債(民營)(外國)              
民營評價		
121130127   FVOCI債務工具評價調整-普通公司債(民營)(外國)      
- 外幣債(中央公債)-FVPL		
    - 中央公債		
帳面		
120050105   強制FVPL金融資產-公債-中央政府(外國)              
評價		
120070105   強制FVPL金融資產評價調整-公債-中央-外國           
            		
- 外幣債(中央公債)-FVOCI 		
    - 中央公債		
帳面		
121110105   FVOCI債務工具-公債-中央政府(外國)                 
評價		
121130105   FVOCI債務工具評價調整-公債-中央政府(外國)         
- 外幣債(中央公債)-AC		
    - 中央公債		
帳面		
122010105   AC債務工具投資-公債-中央政府(外國)                
        評價  		
		
		
- 外幣債(公司債)-AC		
    - 公司債		
公營帳面		
122010125   AC債務工具投資-普通公司債(公營)(外國)             
民營帳面		
122010127   AC債務工具投資-普通公司債(民營)(外國)             
		
- 外幣債(金融債)-AC 		
    - "金融債一般"		
帳面		
122010147   AC債務工具投資-金融債券-海外                      
    - "金融債次順位"		
        帳面  		
    - "金融債其他"		
        帳面  		
- 外幣債(金融債)-FVPL 目的		
    "金融債一般"		
帳面		
120050147   #N/A
評價		
120070147   #N/A
- AC 債務工具累計減損		
AC 中央公債 		
122030101   累積減損-AC債務工具投資-公債-中央                 
AC 地方公債 		
122030103   累積減損-AC債務工具投資-公債-地方                 
AC 中央公債-外國		
122030105   累積減損-AC債務工具投資-公債-中央政府(外國)       
AC 公營公司債    		
122030121   累積減損-累積減損-AC債務工具投資-普通公司(公營)   
AC 民營公司債    		
122030123   累積減損-AC債務工具投資-普通公司(民營)            
AC 公營公司債(外幣)    		
122030125   累積減損-AC債務工具投資-普通公司(公營)(外國)      
AC 民營公司債(外幣)        		
122030127   累積減損-AC債務工具投資-普通公司(民營)(外國)      
AC 金融債(外幣)      		
122030147   累積減損-AC債務工具投資-金融債券-海外             
AC 央行NCD        		
122030911   累積減損-AC債務工具投資-央行NCD                   
- FVOCI債務工具累計減損		
FVOCI債務備抵損失-公債-中央政府(我國)                     		
325350101   FVOCI債務備抵損失-公債-中央政府(我國)             
FVOCI債務備抵損失-公債-地方政府(我國)                     		
325350103   FVOCI債務備抵損失-公債-地方政府(我國)             
FVOCI債務備抵損失-公債-中央政府(外國)                     		
325350105   FVOCI債務備抵損失-公債-中央政府(外國)             
FVOCI債務備抵損失-普通公司債(公營)                       		
325350121   FVOCI債務備抵損失-普通公司債(公營)                
FVOCI債務備抵損失-普通公司債(民營)                       		
325350123   FVOCI債務備抵損失-普通公司債(民營)                
FVOCI債務備抵損失-普通公司債(公營)(外國)               		
325350125   FVOCI債務備抵損失-普通公司債(公營)(外國)          
FVOCI債務備抵損失-普通公司債(民營)(外國)               		
325350127   FVOCI債務備抵損失-普通公司債(民營)(外國)          
FVOCI債務備抵損失-金融債券-海外                         		
325350129   FVOCI債務備抵損失-金融債券-海外                   
FVOCI債務備抵損失-央行NCD                               		
325350911   FVOCI債務備抵損失-央行NCD                         
		
- 外幣債(公司債)-FVPL		
    "公司債一般"		
公營帳面    		
120050125   強制FVPL金融資產-普通公司債(公營)(外國)           
公營評價    		
120070125   強制FVPL金融資產評價調整-普通公司債(公營)(外國)   
民營帳面    		
120050127   強制FVPL金融資產-普通公司債(民營)(外國)           
民營評價    		
120070127   強制FVPL金融資產評價調整-普通公司債(民營)(外國)   
		
		
		
-- =============================		
		
		
ai605		
		
- 表三：嵌入式衍生工具明細表		
    - 可轉換公司債資產交換 強制透過損益按公允價值衡量之金融資產 		
        - 原始金額		
120057307		
        - 本期帳列金額		
120057307   強制FVPL金融資產-衍生性ＳＷＡＰ-ASS               
120077307   強制FVPL金融資產評價調整-ＳＷＡＰ-ASS             
120079031   強制FVPL金融資產評價調整-CVA-SWAP-ASS             
