-- ==================================================

table10


1.公債

    原始取得成本1
120050101
120050103
121110101
121110103
122010101
122010103

    透過損益按公允價值衡量之金融資產2 A
120050101
120050103
120070101
120070103

    透過其他綜合損益按公允價值衡量之金融資產2 B
121110101
121110103
121130101
121130103

    按攤銷後成本衡量之債務工具投資2 C
122010101
122010103
122030101
122030103


2.公司債
2.1.公營事業
    原始取得成本1
120050121
121110121
122010121

    透過損益按公允價值衡量之金融資產2 A
120050121
120070121

    透過其他綜合損益按公允價值衡量之金融資產2 B
121110121

    按攤銷後成本衡量之債務工具投資2 C
122010121

2.2.民營企業-國內公司債
    原始取得成本1
120050123

    透過損益按公允價值衡量之金融資產2 A
120050123
120070123

    透過其他綜合損益按公允價值衡量之金融資產2 B
121110123

    按攤銷後成本衡量之債務工具投資2 C
122010123

3.股票及股權投資-民營企業

    原始取得成本1
1200503
1210103
15501
121019901
150019901

    透過損益按公允價值衡量之金融資產2 A
1200503

    透過其他綜合損益按公允價值衡量之金融資產2 B
1210103
1210303
1210199
1210399

    按攤銷後成本衡量之債務工具投資2 C
    
    採用權益法之投資-淨額2 E
15001
15003

4.受益憑證-其他

    原始取得成本1
1200505

    透過損益按公允價值衡量之金融資產2 A
1200505
1200705

    透過其他綜合損益按公允價值衡量之金融資產2 B

    按攤銷後成本衡量之債務工具投資2 C

5.新台幣可轉讓定期存單-中央銀行發行

    原始取得成本1
121110911
122010911

    透過損益按公允價值衡量之金融資產2 A

    透過其他綜合損益按公允價值衡量之金融資產2 B
121110911
121130911

    按攤銷後成本衡量之債務工具投資2 C
122010911
122030911

6.商業本票-民營企業

    原始取得成本1
120050903

    透過損益按公允價值衡量之金融資產2 A
120050903
120070903

    透過其他綜合損益按公允價值衡量之金融資產2 B

    按攤銷後成本衡量之債務工具投資2 C

7.國外機構發行-在國外發行-長期債票券6

    原始取得成本1
140010147

    透過損益按公允價值衡量之金融資產2 A

    透過其他綜合損益按公允價值衡量之金融資產2 B
140010147
140030147

    按攤銷後成本衡量之債務工具投資2 C






-- =======================
table20

- 民營企業
    - 其他到期日
        - 公債
225010101
        - 公司債
225010105
        - 商業本票
225010303





-- =====================


table40

- 台幣數字
    - 衍生性金融資產
        - 國內
            - 強制透過損益按公允價值衡量之金融資產2
                - 成本 A
120057307

                - 公允價值6 B
120057307
120077307
120079031

            - 避險之金融資產4
                - 成本 A
                - 公允價值6 B
        - OBU
            - 強制透過損益按公允價值衡量之金融資產2
                - 成本 A
                - 公允價值6 B
            - 避險之金融資產4
                - 成本 A
                - 公允價值6 B
        - 國外
            - 強制透過損益按公允價值衡量之金融資產2
                - 成本 A
                - 公允價值6 B
            - 避險之金融資產4
                - 成本 A
                - 公允價值6 B
    - 衍生性金融負債
        - 國內
            - 持有供交易之金融負債3
                - 成本 A
                - 公允價值6 B
            - 避險之金融負債5
                - 成本 A
                - 公允價值6 B
        - OBU
            - 持有供交易之金融負債3
                - 成本 A
                - 公允價值6 B
            - 避險之金融負債5
                - 成本 A
                - 公允價值6 B
        - 國外
            - 持有供交易之金融負債3
                - 成本 A
                - 公允價值6 B
            - 避險之金融負債5
                - 成本 A
                - 公允價值6 B        
- 外幣數字
    - 衍生性金融資產
        - 國內
            - 強制透過損益按公允價值衡量之金融資產2
                - 成本 A
                - 公允價值6 B
1200771

            - 避險之金融資產4
                - 成本 A
                - 公允價值6 B
        - OBU
            - 強制透過損益按公允價值衡量之金融資產2
                - 成本 A
                - 公允價值6 B
            - 避險之金融資產4
                - 成本 A
                - 公允價值6 B
        - 國外
            - 強制透過損益按公允價值衡量之金融資產2
                - 成本 A
                - 公允價值6 B
            - 避險之金融資產4
                - 成本 A
                - 公允價值6 B
    - 衍生性金融負債
        - 國內
            - 持有供交易之金融負債3
                - 成本 A
                - 公允價值6 B
2200371
S28
            - 避險之金融負債5
                - 成本 A
                - 公允價值6 B
        - OBU
            - 持有供交易之金融負債3
                - 成本 A
                - 公允價值6 B
            - 避險之金融負債5
                - 成本 A
                - 公允價值6 B
        - 國外
            - 持有供交易之金融負債3
                - 成本 A
                - 公允價值6 B
            - 避險之金融負債5
                - 成本 A
                - 公允價值6 B        
      



-- ========================================

ai233


- 透過損益按公允價值衡量A1
    - 投資成本
        - 政府公債A
            120050101	強制FVPL金融資產-公債-中央政府(我國)              
            120050103	強制FVPL金融資產-公債-地方政府(我國)              
        - 公司債B
            120050121	強制FVPL金融資產-普通公司債(公營)                 
            120050123	強制FVPL金融資產-普通公司債(民營)                 
            120057307	強制FVPL金融資產-衍生性ＳＷＡＰ-ASS               
        - 金融債券C市                              
        - 權益證券投資D
            120050301	強制FVPL金融資產-普通股-上市公司                  
            120050302	強制FVPL金融資產-普通股-上櫃公司                  
            120050311	強制FVPL金融資產-特別股-上        
        - 結構型商品E
        - 證券化商品F
        - 其它投資部位G
            120070501	強制FVPL金融資產評價調整-受益憑證                 
            120070903	強制FVPL金融資產評價調整-商業本票                 
        - 央行可轉讓定期存單H
	- 帳面價值 = 投資成本 + 以下
        - 政府公債A
            120070101	強制FVPL金融資產評價調整-公債-中央(我國)          
            120070103	強制FVPL金融資產評價調整-公債-地方(我國)                 
        - 公司債B
            120070121	強制FVPL金融資產評價調整-普通公司債(公營)         
            120070123	強制FVPL金融資產評價調整-普通公司債(民營)         
            120077307	強制FVPL金融資產評價調整-ＳＷＡＰ-ASS             
            120079031	強制FVPL金融資產評價調整-CVA-SWAP-ASS             
        - 金融債券C
        - 權益證券投資D
            120070301	強制FVPL金融資產評價調整-上市公司                 
            120070302	強制FVPL金融資產評價調整-上櫃公司                 
            120070311	強制FVPL金融資產評價調整-特別股-上市                      
        - 結構型商品E
        - 證券化商品F
        - 其它投資部位G
            120070501	強制FVPL金融資產評價調整-受益憑證                 
            120070903	強制FVPL金融資產評價調整-商業本票                 
        - 央行可轉讓定期存單H

120050101	強制FVPL金融資產-公債-中央政府(我國)              
120050103	強制FVPL金融資產-公債-地方政府(我國)              
120050121	強制FVPL金融資產-普通公司債(公營)                 
120050123	強制FVPL金融資產-普通公司債(民營)                 
120050301	強制FVPL金融資產-普通股-上市公司                  
120050302	強制FVPL金融資產-普通股-上櫃公司                  
120050311	強制FVPL金融資產-特別股-上市                      
120050501	強制FVPL金融資產-受益憑證                         
120050903	強制FVPL金融資產-商業本票                         
120057307	強制FVPL金融資產-衍生性ＳＷＡＰ-ASS               
120070101	強制FVPL金融資產評價調整-公債-中央(我國)          
120070103	強制FVPL金融資產評價調整-公債-地方(我國)          
120070121	強制FVPL金融資產評價調整-普通公司債(公營)         
120070123	強制FVPL金融資產評價調整-普通公司債(民營)         
120070301	強制FVPL金融資產評價調整-上市公司                 
120070302	強制FVPL金融資產評價調整-上櫃公司                 
120070311	強制FVPL金融資產評價調整-特別股-上市              
120070501	強制FVPL金融資產評價調整-受益憑證                 
120070903	強制FVPL金融資產評價調整-商業本票                 
120077307	強制FVPL金融資產評價調整-ＳＷＡＰ-ASS             
120079031	強制FVPL金融資產評價調整-CVA-SWAP-ASS             

	
- 透過其他綜合損益按公允價值衡量A6
    - 投資成本
        - 政府公債A
            121110101	FVOCI債務工具-公債-中央政府(我國)                 
            121110103	FVOCI債務工具-公債-地方政府(我國)                 
        - 公司債B
            121110121	FVOCI債務工具-普通公司債（公營）                  
            121110123	FVOCI債務工具-普通公司債（民營）                  
        - 金融債券C
        - 權益證券投資D
            121010301	FVOCI權益工具-普通股-上市公司                     
            121010302	FVOCI權益工具-普通股-上櫃公司                     
            121019901	FVOCI權益工具-其他                                
        - 結構型商品E
        - 證券化商品F    
        - 其它投資部位G
        - 央行可轉讓定期存單H
            121110911	FVOCI債務工具-央行NCD                             
    - 帳面價值
        - 政府公債A
            121130101	FVOCI債務工具評價調整-公債-中央政府               
            121130103	FVOCI債務工具評價調整-公債-地方政府                       
            325350103	FVOCI債務備抵損失-公債-地方政府(我國)             
        - 公司債B
            121130121	FVOCI債務工具評價調整-普通公司債（公營)           
            121130123	FVOCI債務工具評價調整-普通公司債（民營)                       
            325350121	FVOCI債務備抵損失-普通公司債(公營)                
            325350123	FVOCI債務備抵損失-普通公司債(民營)                
        - 金融債券C
        - 權益證券投資D
            121030301	FVOCI權益工具評價調整-普通股-上市                 
            121030302	FVOCI權益工具評價調整-普通股-上櫃                 
            121039901	FVOCI權益工具評價調整-其他                                
        - 結構型商品E
        - 證券化商品F    
        - 其它投資部位G
        - 央行可轉讓定期存單H
            121130911	FVOCI債務工具評價調整-央行NCD                     
            325350911	FVOCI債務備抵損失-央行NCD                         

121010301	FVOCI權益工具-普通股-上市公司                     
121010302	FVOCI權益工具-普通股-上櫃公司                     
121019901	FVOCI權益工具-其他                                
121110101	FVOCI債務工具-公債-中央政府(我國)                 
121110103	FVOCI債務工具-公債-地方政府(我國)                 
121110121	FVOCI債務工具-普通公司債（公營）                  
121110123	FVOCI債務工具-普通公司債（民營）                  
121110911	FVOCI債務工具-央行NCD                             
121030301	FVOCI權益工具評價調整-普通股-上市                 
121030302	FVOCI權益工具評價調整-普通股-上櫃                 
121039901	FVOCI權益工具評價調整-其他                        
121130101	FVOCI債務工具評價調整-公債-中央政府               
121130103	FVOCI債務工具評價調整-公債-地方政府               
121130121	FVOCI債務工具評價調整-普通公司債（公營)           
121130123	FVOCI債務工具評價調整-普通公司債（民營)           
121130911	FVOCI債務工具評價調整-央行NCD                     
325350103	FVOCI債務備抵損失-公債-地方政府(我國)             
325350121	FVOCI債務備抵損失-普通公司債(公營)                
325350123	FVOCI債務備抵損失-普通公司債(民營)                
325350911	FVOCI債務備抵損失-央行NCD                         

	
- 按攤銷後成本衡量A7
    - 投資成本
        - 政府公債A
            122010101	AC債務工具投資-公債-中央政府(我國)                
            122010103	AC債務工具投資-公債-地方政府(我國)                                
        - 公司債B
            122010121	AC債務工具投資-普通公司債(公營)                   
            122010123	AC債務工具投資-普通公司債(民營)                                
        - 金融債券C
        - 權益證券投資D
        - 結構型商品E
        - 證券化商品F
        - 其它投資部位G
        - 央行可轉讓定期存單H        
            122010911	AC債務工具投資-央行NCD        
	- 帳面價值
        - 政府公債A
            122030101	累積減損-AC債務工具投資-公債-中央                 
            122030103	累積減損-AC債務工具投資-公債-地方                         
        - 公司債B
            122030121	累積減損-累積減損-AC債務工具投資-普通公司(公營)   
            122030123	累積減損-AC債務工具投資-普通公司(民營)            
        - 金融債券C
        - 權益證券投資D
        - 結構型商品E
        - 證券化商品F    
        - 其它投資部位G
        - 央行可轉讓定期存單H
            122030911	累積減損-AC債務工具投資-央行NCD                   



122010101	AC債務工具投資-公債-中央政府(我國)                
122010103	AC債務工具投資-公債-地方政府(我國)                
122010121	AC債務工具投資-普通公司債(公營)                   
122010123	AC債務工具投資-普通公司債(民營)                   
122010911	AC債務工具投資-央行NCD                            
122030101	累積減損-AC債務工具投資-公債-中央                 
122030103	累積減損-AC債務工具投資-公債-地方                 
122030121	累積減損-累積減損-AC債務工具投資-普通公司(公營)   
122030123	累積減損-AC債務工具投資-普通公司(民營)            
122030911	累積減損-AC債務工具投資-央行NCD          




-- =============================

ai405


- 持有餘額
    - 政府債券
=IF(ISNA(VLOOKUP(120050101,'C'!$A:$C,3,0)),0,(VLOOKUP(120050101,'C'!$A:$C,3,0)))+
 IF(ISNA(VLOOKUP(120050103,'C'!$A:$C,3,0)),0,(VLOOKUP(120050103,'C'!$A:$C,3,0)))+
 IF(ISNA(VLOOKUP(125010101,'C'!$A:$C,3,0)),0,(VLOOKUP(125010101,'C'!$A:$C,3,0)))+
 IF(ISNA(VLOOKUP(121110101,'C'!$A:$C,3,0)),0,(VLOOKUP(121110101,'C'!$A:$C,3,0)))+
 IF(ISNA(VLOOKUP(121110103,'C'!$A:$C,3,0)),0,(VLOOKUP(121110103,'C'!$A:$C,3,0)))+
 IF(ISNA(VLOOKUP(122010101,'C'!$A:$C,3,0)),0,(VLOOKUP(122010101,'C'!$A:$C,3,0)))+
 IF(ISNA(VLOOKUP(122010103,'C'!$A:$C,3,0)),0,(VLOOKUP(122010103,'C'!$A:$C,3,0)))

120050101
120050103
125010101
121110101
121110103
122010101
122010103


    - 金融債券
=IF(ISNA(+VLOOKUP(122010147,'C'!$A:$C,3,0)),0,(+VLOOKUP(122010147,'C'!$A:$C,3,0)))+
 IF(ISNA(+VLOOKUP(121110147,'C'!$A:$C,3,0)),0,(+VLOOKUP(121110147,'C'!$A:$C,3,0)))+
 IF(ISNA(+VLOOKUP(120050147,'C'!$A:$C,3,0)),0,(+VLOOKUP(120050147,'C'!$A:$C,3,0)))-
 (IF(ISNA(+VLOOKUP(122010147,'C'!$A:$C,3,0)),0,(+VLOOKUP(122010147,'C'!$A:$C,3,0)))+
 IF(ISNA(+VLOOKUP(121110147,'C'!$A:$C,3,0)),0,(+VLOOKUP(121110147,'C'!$A:$C,3,0)))+
 IF(ISNA(+VLOOKUP(120050147,'C'!$A:$C,3,0)),0,(+VLOOKUP(120050147,'C'!$A:$C,3,0))))

為什麼這邊加了一樣的職，卻又扣掉一樣的值

122010147
121110147
120050147

122010147
121110147
120050147



    - 公司債
=IF(ISNA(+VLOOKUP(120057307,'C'!$A:$C,3,0)),0,(+VLOOKUP(120057307,'C'!$A:$C,3,0)))+
 IF(ISNA(VLOOKUP(120050121,'C'!$A:$C,3,0)),0,(VLOOKUP(120050121,'C'!$A:$C,3,0)))+
 IF(ISNA(VLOOKUP(120050123,'C'!$A:$C,3,0)),0,(VLOOKUP(120050123,'C'!$A:$C,3,0)))+
 IF(ISNA(VLOOKUP(121110121,'C'!$A:$C,3,0)),0,(VLOOKUP(121110121,'C'!$A:$C,3,0)))+
 IF(ISNA(VLOOKUP(121110123,'C'!$A:$C,3,0)),0,(VLOOKUP(121110123,'C'!$A:$C,3,0)))+
 IF(ISNA(VLOOKUP(122010121,'C'!$A:$C,3,0)),0,(VLOOKUP(122010121,'C'!$A:$C,3,0)))+
 IF(ISNA(VLOOKUP(122010123,'C'!$A:$C,3,0)),0,(VLOOKUP(122010123,'C'!$A:$C,3,0)))+
 IF(ISNA(VLOOKUP(121110127,'C'!$A:$C,3,0)),0,(VLOOKUP(121110127,'C'!$A:$C,3,0)))-
 (IF(ISNA(VLOOKUP(121110127,'C'!$A:$C,3,0)),0,(VLOOKUP(121110127,'C'!$A:$C,3,0))))


120057307
120050121
120050123
121110121
121110123
122010121
122010123

121110127
121110127 相互扣掉



-- ====================================

ai430

- 金額
    - 新臺幣商業本票
        - 新臺幣融資性本票
=VLOOKUP(120050903,'C'!A:C,3,0)+
VLOOKUP(1250103,'C'!A:C,3,0)

120050903
1250103

S欄位 面額
    - 央行可轉讓定期存單
=VLOOKUP(1211109,'C'!A:C,3,0)+
VLOOKUP(1220109,'C'!A:C,3,0)


1211109
1220109



-- ============================

AI601

- 公債
    - FVPL (中央+地方)
        - FVPL -中央b
        120050101
        - FVPL -地方
        120050103
        - FVOCI -中央
        121110101
        - FVOCI -地方
        121110103


    - FVOCI (中央+地方)
    - AC -中央
    122010101
    - AC -地方
    122010103

- 公司債
    - FVPL -公營
    120050121
    - FVPL -公營評價
    120070121
    - FVPL -民營
    120050123
    - FVPL -民營評價
    120070123



- 股權

股權	高鐵		
	財金公司		=8580000+782542+858924
	台灣金聯		60000000
	台灣金融		50000000
	台灣集保		6104772
	陽光AMC+行動支付		=154280+3000000
	華泰保險經紀		0


- 股票
    - FVPL -上市
    120050301
    - FVPL -上市-特別股
    120050311
    - FVPL -上櫃
    120050302
    - FVOCI -上市
    121010301
    - FVOCI -上櫃
    121010302


- 受益憑證
    - 新光敦南
    - 玉山CBO-A2

- 公司債
    - CB
    120057307
    - FVOCI 
        - FVOCI -公營
        121110121
        - FVOCI -民營
        121110123
    - AC 
        - AC -公營
        122010121
        - AC -民營
        122010123
    - FVPL
        - FVPL -公營
        120050121
        - FVPL -民營
        120050123

- 金融債券
    - 94安泰5

- 央行NCD
    - FVOCI 
    121110911
    - AC
    122010911


- FVPL 目的金融資產
    - 受益憑證
        - 帳面	120050501
        - 評價	120070501
    - 公債
        - 評價
            FVPL -中央	120070101
            FVPL -地方	120070103
    - 股票
        帳面-上市	
        帳面-上櫃	
        帳面-特別股	
        評價-上市	120070301
        評價-上櫃	120070302
        評價-特別股	120070311


- FVOCI 出售金融資產
    - 股票(FVOCI 股票不能投資上櫃)
        帳面-上市-金融	
        帳面-上市-非金	
        帳面-上櫃-金融	
        帳面-上櫃-非金	
        評價-上市	121030301
        評價-上櫃	
    - "股票-其他轉投資等六家"
        帳面	121019901
	    評價	121039901
    - 央行NCD
        帳面	121110911
        評價	121130911
        AC帳面	122010911

    - 公債
        - 帳面
	    - 評價
            FVOCI -中央	121130101
            FVOCI -地方	121130103

    - 公司債
        公營帳面	121110121
        民營帳面	121110123
        公營評價	121130121
        民營評價	121130123
    - 權益法
        帳面	15001
        評價	15003

    - 資產交換CB
        帳面	120057307
        評價	120077307
        減損	120079031

    附買回票券及債券負債-公債 		225010101
    附買回票券及債券負債-公司債 		225010105

- 外幣債(金融債)-FVOCI 
    - "金融債一般"
        帳面	121110147
        評價	121130147

- 商業本票
    - FVPL 目的
        帳面	120050903
        評價	120070903
- 外幣債(公司債)-FVOCI 
    - "公司債一般"
        公營帳面	121110125
        公營評價	121130125
        民營帳面	121110127
        民營評價	121130127
- 外幣債(中央公債)-FVPL
    - 中央公債
        帳面	120050105
        評價	120070105
            
- 外幣債(中央公債)-FVOCI 
    - 中央公債
        帳面	121110105
        評價	121130105
- 外幣債(中央公債)-AC
    - 中央公債
        帳面	122010105
	    評價	


- 外幣債(公司債)-AC
    - 公司債
        公營帳面	122010125
        民營帳面	122010127

- 外幣債(金融債)-AC 
    - "金融債一般"
        帳面	122010147
    - "金融債次順位"
        帳面	
    - "金融債其他"
        帳面	
- 外幣債(金融債)-FVPL 目的
    "金融債一般"
        帳面	120050147
        評價	120070147
- AC 債務工具累計減損
    AC 中央公債		122030101
    AC 地方公債		122030103
    AC 中央公債-外國		122030105
    AC 公營公司債		122030121
    AC 民營公司債		122030123
    AC 公營公司債(外幣)		122030125
    AC 民營公司債(外幣)		122030127
    AC 金融債(外幣)		122030147
    AC 央行NCD		122030911
- FVOCI債務工具累計減損
    FVOCI債務備抵損失-公債-中央政府(我國)             		325350101
    FVOCI債務備抵損失-公債-地方政府(我國)             		325350103
    FVOCI債務備抵損失-公債-中央政府(外國)             		325350105
    FVOCI債務備抵損失-普通公司債(公營)                		325350121
    FVOCI債務備抵損失-普通公司債(民營)                		325350123
    FVOCI債務備抵損失-普通公司債(公營)(外國)          		325350125
    FVOCI債務備抵損失-普通公司債(民營)(外國)          		325350127
    FVOCI債務備抵損失-金融債券-海外                   		325350129
    FVOCI債務備抵損失-央行NCD                         		325350911

- 外幣債(公司債)-FVPL
    "公司債一般"
        公營帳面	120050125
        公營評價	120070125
        民營帳面	120050127
        民營評價	120070127



-- =============================


ai605

- 表三：嵌入式衍生工具明細表
    - 可轉換公司債資產交換 強制透過損益按公允價值衡量之金融資產
        - 原始金額
        =VLOOKUP(120057307,餘額A!A:C,3,0)
        - 本期帳列金額
        =VLOOKUP(120057307,餘額A!A:C,3,0)+
        VLOOKUP(120077307,餘額A!A:C,3,0)+
        VLOOKUP(120079031,餘額A!A:C,3,0)
	

        - 原始金額
120057307
        - 本期帳列金額
120057307
120077307
120079031
	

-- =============================


ai345
Ⅰ類A
1100	㈠有價證券及衍生性金融資產			=F9+F10+F13+F14
1110	 1.透過損益按公允價值衡量之金融資產	 
                =SUM(金融商品類!D3:D39)+
                SUM(金融商品類!D96:D106)
            其中SUM(金融商品類!D3:D39) 評價借方
1.透過損益按公允價值衡量之金融資產
成本
120050101	強制FVPL金融資產-公債-中央政府(我國)              
120050103	強制FVPL金融資產-公債-地方政府(我國)              
120050105	強制FVPL金融資產-公債-中央政府(外國)              
120050107	強制FVPL金融資產-公債-地方政府(外國)              
120050121	強制FVPL金融資產-普通公司債(公營)                 
120050123	強制FVPL金融資產-普通公司債(民營)                 
120050125	強制FVPL金融資產-普通公司債(公營)(外國)           
120050127	強制FVPL金融資產-普通公司債(民營)(外國)           
120050147	#N/A
120050301	強制FVPL金融資產-普通股-上市公司                  
120050302	強制FVPL金融資產-普通股-上櫃公司                  
120050311	強制FVPL金融資產-特別股-上市                      
120057307	強制FVPL金融資產-衍生性ＳＷＡＰ-ASS               
120057701	#N/A
120050501	強制FVPL金融資產-受益憑證                         
120050903	強制FVPL金融資產-商業本票                         
評價	
120070101	強制FVPL金融資產評價調整-公債-中央(我國)          
120070103	強制FVPL金融資產評價調整-公債-地方(我國)          
120070105	強制FVPL金融資產評價調整-公債-中央-外國           
120070121	強制FVPL金融資產評價調整-普通公司債(公營)         
120070123	強制FVPL金融資產評價調整-普通公司債(民營)         
120070125	強制FVPL金融資產評價調整-普通公司債(公營)(外國)   
120070127	強制FVPL金融資產評價調整-普通公司債(民營)(外國)   
120070147	#N/A
120070301	強制FVPL金融資產評價調整-上市公司                 
120070302	強制FVPL金融資產評價調整-上櫃公司                 
120070311	強制FVPL金融資產評價調整-特別股-上市              
120077101	強制FVPL金融資產評價調整-遠匯(評價)               
	
120077307	強制FVPL金融資產評價調整-ＳＷＡＰ-ASS             
120077701	#N/A
120079001	強制FVPL金融資產評價調整-貸方評價調整             
120070501	強制FVPL金融資產評價調整-受益憑證                 
120070903	強制FVPL金融資產評價調整-商業本票                 

            其中SUM(金融商品類!D96:D106) 借方
(四)衍生性金融商品		
評價
120079011	強制FVPL金融資產評價調整-CVA--遠匯
120079031	強制FVPL金融資產評價調整-CVA--SWAP
120079071	強制FVPL金融資產評價調整-CVA--選擇權



1140	2.透過其他綜合損益按公允價值衡量之金融資產			
                =SUM(F11:F12)


1141	A.透過其他綜合損益按公允價值衡量之權益工具			
                =SUM(金融商品類!D43:D44,金融商品類!D55:D56)
2.透過其他綜合損益按公允價值衡量之金融資產	借方
成本	
121010301	FVOCI權益工具-普通股-上市公司                     
121019901	FVOCI權益工具-其他                                
評價	
121030301	FVOCI權益工具評價調整-普通股-上市                 
121039901	FVOCI權益工具評價調整-其他                        


1142	B.透過其他綜合損益按公允價值衡量之債務工具			
                =SUM(金融商品類!D45:D53,金融商品類!D57:D65)
借方

成本	                             
121110101	FVOCI債務工具-公債-中央政府(我國)                 
121110103	FVOCI債務工具-公債-地方政府(我國)                 
121110105	FVOCI債務工具-公債-中央政府(外國)                 
121110121	FVOCI債務工具-普通公司債（公營）                  
121110123	FVOCI債務工具-普通公司債（民營）                  
121110125	FVOCI債務工具-普通公司債(公營)(外國)              
121110127	FVOCI債務工具-普通公司債(民營)(外國)              
121110147	FVOCI債務工具-金融債券-海外                       
121110911	FVOCI債務工具-央行NCD                             

評價	
121130101	FVOCI債務工具評價調整-公債-中央政府               
121130103	FVOCI債務工具評價調整-公債-地方政府               
121130105	FVOCI債務工具評價調整-公債-中央政府(外國)         
121130121	FVOCI債務工具評價調整-普通公司債（公營)           
121130123	FVOCI債務工具評價調整-普通公司債（民營)           
121130125	FVOCI債務工具評價調整-普通公司債(公營)(外國)      
121130127	FVOCI債務工具評價調整-普通公司債(民營)(外國)      
121130147	FVOCI債務工具評價調整-金融債券-海外               
121130911	FVOCI債務工具評價調整-央行NCD                     

1150	    3.按攤銷後成本衡量之債務工具投資			
                =SUM(金融商品類!D69:D82)

借方
3.按攤銷後成本衡量之債務工具投資	
成本	
122010101	AC債務工具投資-公債-中央政府(我國)                
122010103	AC債務工具投資-公債-地方政府(我國)                
122010105	AC債務工具投資-公債-中央政府(外國)                
122010121	AC債務工具投資-普通公司債(公營)                   
122010123	AC債務工具投資-普通公司債(民營)                   
122010125	AC債務工具投資-普通公司債(公營)(外國)             
122010127	AC債務工具投資-普通公司債(民營)(外國)             
122010147	AC債務工具投資-金融債券-海外                      
122010911	AC債務工具投資-央行NCD                            
	
	
累計減損	
1220301	累積減損-AC債務工具投資-債券                      
1220309	累積減損-AC債務工具投資-票券                      



1190	    4.其他金融資產			
                =SUM(金融商品類!D92:D93)
無

1200	㈡採用權益法之投資			
                =SUM(金融商品類!D87:D89)
借方
(二)採用權益法之投資	
成本	
15001	採用權益法之投資成本                              
評價	
15003	加（減）：採用權益法認列之投資權益調整            


1300	㈢其他投資			
1450	㈣避險之金融資產			
1500	㈤放款	
1510	    1.逾期放款			


V類E

1100	㈠有價證券及衍生性金融資產
                    =J9+J10+J13+J14	=K9+K10+K13+K14
1110	 1.透過損益按公允價值衡量之金融資產	 
                    =ABS(SUM(金融商品類!E20:E39))+
                    ABS(SUM(金融商品類!E99:E106))	
            SUM(金融商品類!E20:E39) 貸方
評價	
120070101	強制FVPL金融資產評價調整-公債-中央(我國)          
120070103	強制FVPL金融資產評價調整-公債-地方(我國)          
120070105	強制FVPL金融資產評價調整-公債-中央-外國           
120070121	強制FVPL金融資產評價調整-普通公司債(公營)         
120070123	強制FVPL金融資產評價調整-普通公司債(民營)         
120070125	強制FVPL金融資產評價調整-普通公司債(公營)(外國)   
120070127	強制FVPL金融資產評價調整-普通公司債(民營)(外國)   
120070147	#N/A
120070301	強制FVPL金融資產評價調整-上市公司                 
120070302	強制FVPL金融資產評價調整-上櫃公司                 
120070311	強制FVPL金融資產評價調整-特別股-上市              
120077101	強制FVPL金融資產評價調整-遠匯(評價)               
		
120077307	強制FVPL金融資產評價調整-ＳＷＡＰ-ASS             
120077701	#N/A
120079001	強制FVPL金融資產評價調整-貸方評價調整             
120070501	強制FVPL金融資產評價調整-受益憑證                 
120070903	強制FVPL金融資產評價調整-商業本票                 

            SUM(金融商品類!E99:E106) 貸方

(四)衍生性金融商品	
	
評價	
	
120079011	強制FVPL金融資產評價調整-CVA--遠匯
120079031	強制FVPL金融資產評價調整-CVA--SWAP
120079071	強制FVPL金融資產評價調整-CVA--選擇權
                    =J9

1140	2.透過其他綜合損益按公允價值衡量之金融資產			
                    =SUM(J11:J12)	
                    =J10
1141	A.透過其他綜合損益按公允價值衡量之權益工具			
                    =ABS(SUM(金融商品類!E55:E56))	
貸方
2.透過其他綜合損益按公允價值衡量之金融資產
評價	
121030301	FVOCI權益工具評價調整-普通股-上市                 
121039901	FVOCI權益工具評價調整-其他                        

                    =J11
1142	B.透過其他綜合損益按公允價值衡量之債務工具			
                    =ABS(SUM(金融商品類!E57:E65))	
2.透過其他綜合損益按公允價值衡量之金融資產
評價	
121030301	FVOCI權益工具評價調整-普通股-上市                 
121039901	FVOCI權益工具評價調整-其他                        
121130101	FVOCI債務工具評價調整-公債-中央政府               
121130103	FVOCI債務工具評價調整-公債-地方政府               
121130105	FVOCI債務工具評價調整-公債-中央政府(外國)         
121130121	FVOCI債務工具評價調整-普通公司債（公營)           
121130123	FVOCI債務工具評價調整-普通公司債（民營)           
121130125	FVOCI債務工具評價調整-普通公司債(公營)(外國)      
121130127	FVOCI債務工具評價調整-普通公司債(民營)(外國)      
121130147	FVOCI債務工具評價調整-金融債券-海外               
121130911	FVOCI債務工具評價調整-央行NCD                     
                    =J12
1150	    3.按攤銷後成本衡量之債務工具投資			
                    =ABS(SUM(金融商品類!E81:E81))	
                    
3.按攤銷後成本衡量之債務工具投資
累計減損	
1220301	累積減損-AC債務工具投資-債券                      

                    =J13
1190	    4.其他金融資產			
                
1200	㈡採用權益法之投資			
                
1300	㈢其他投資			
1450	㈣避險之金融資產			
1500	㈤放款	
1510	    1.逾期放款			





1700	    7.其他				=SUM(Q37:Q227)			=28999996-158904+SUM(M37:M227)-28999996+158904	=SUM(G37:J37)	=ROUND(G37*0.02+H37*0.1+I37*0.5+J37,0)










