2.部位底稿:更新不動產投資部位(J60及J61欄位,資料由AI601總務提供),留意是否有台幣投資相關之新會科

*不動產投資部位 由 總務提供(J60及J61欄位)

餘額C



- 透過損益按公允價值衡量A1
    - 投資成本
        - 政府公債A
            120050101	強制FVPL金融資產-公債-中央政府(我國)              
            120050103	強制FVPL金融資產-公債-地方政府(我國)              
        - 公司債B
            120050121	強制FVPL金融資產-普通公司債(公營)                 
            120050123	強制FVPL金融資產-普通公司債(民營)                 
            120057307	強制FVPL金融資產-衍生性ＳＷＡＰ-ASS               
        - 金融債券C市                              
        - 權益證券投資D
            120050301	強制FVPL金融資產-普通股-上市公司                  
            120050302	強制FVPL金融資產-普通股-上櫃公司                  
            120050311	強制FVPL金融資產-特別股-上        
        - 結構型商品E
        - 證券化商品F
        - 其它投資部位G
            120070501	強制FVPL金融資產評價調整-受益憑證                 
            120070903	強制FVPL金融資產評價調整-商業本票                 
        - 央行可轉讓定期存單H
	- 帳面價值 = 投資成本 + 以下
        - 政府公債A
            120070101	強制FVPL金融資產評價調整-公債-中央(我國)          
            120070103	強制FVPL金融資產評價調整-公債-地方(我國)                 
        - 公司債B
            120070121	強制FVPL金融資產評價調整-普通公司債(公營)         
            120070123	強制FVPL金融資產評價調整-普通公司債(民營)         
            120077307	強制FVPL金融資產評價調整-ＳＷＡＰ-ASS             
            120079031	強制FVPL金融資產評價調整-CVA-SWAP-ASS             
        - 金融債券C
        - 權益證券投資D
            120070301	強制FVPL金融資產評價調整-上市公司                 
            120070302	強制FVPL金融資產評價調整-上櫃公司                 
            120070311	強制FVPL金融資產評價調整-特別股-上市                      
        - 結構型商品E
        - 證券化商品F
        - 其它投資部位G
            120070501	強制FVPL金融資產評價調整-受益憑證                 
            120070903	強制FVPL金融資產評價調整-商業本票                 
        - 央行可轉讓定期存單H

120050101	強制FVPL金融資產-公債-中央政府(我國)              
120050103	強制FVPL金融資產-公債-地方政府(我國)              
120050121	強制FVPL金融資產-普通公司債(公營)                 
120050123	強制FVPL金融資產-普通公司債(民營)                 
120050301	強制FVPL金融資產-普通股-上市公司                  
120050302	強制FVPL金融資產-普通股-上櫃公司                  
120050311	強制FVPL金融資產-特別股-上市                      
120050501	強制FVPL金融資產-受益憑證                         
120050903	強制FVPL金融資產-商業本票                         
120057307	強制FVPL金融資產-衍生性ＳＷＡＰ-ASS               
120070101	強制FVPL金融資產評價調整-公債-中央(我國)          
120070103	強制FVPL金融資產評價調整-公債-地方(我國)          
120070121	強制FVPL金融資產評價調整-普通公司債(公營)         
120070123	強制FVPL金融資產評價調整-普通公司債(民營)         
120070301	強制FVPL金融資產評價調整-上市公司                 
120070302	強制FVPL金融資產評價調整-上櫃公司                 
120070311	強制FVPL金融資產評價調整-特別股-上市              
120070501	強制FVPL金融資產評價調整-受益憑證                 
120070903	強制FVPL金融資產評價調整-商業本票                 
120077307	強制FVPL金融資產評價調整-ＳＷＡＰ-ASS             
120079031	強制FVPL金融資產評價調整-CVA-SWAP-ASS             

	
- 透過其他綜合損益按公允價值衡量A6
    - 投資成本
        - 政府公債A
            121110101	FVOCI債務工具-公債-中央政府(我國)                 
            121110103	FVOCI債務工具-公債-地方政府(我國)                 
        - 公司債B
            121110121	FVOCI債務工具-普通公司債（公營）                  
            121110123	FVOCI債務工具-普通公司債（民營）                  
        - 金融債券C
        - 權益證券投資D
            121010301	FVOCI權益工具-普通股-上市公司                     
            121010302	FVOCI權益工具-普通股-上櫃公司                     
            121019901	FVOCI權益工具-其他                                
        - 結構型商品E
        - 證券化商品F    
        - 其它投資部位G
        - 央行可轉讓定期存單H
            121110911	FVOCI債務工具-央行NCD                             
    - 帳面價值
        - 政府公債A
            121130101	FVOCI債務工具評價調整-公債-中央政府               
            121130103	FVOCI債務工具評價調整-公債-地方政府                       
            325350103	FVOCI債務備抵損失-公債-地方政府(我國)             
        - 公司債B
            121130121	FVOCI債務工具評價調整-普通公司債（公營)           
            121130123	FVOCI債務工具評價調整-普通公司債（民營)                       
            325350121	FVOCI債務備抵損失-普通公司債(公營)                
            325350123	FVOCI債務備抵損失-普通公司債(民營)                
        - 金融債券C
        - 權益證券投資D
            121030301	FVOCI權益工具評價調整-普通股-上市                 
            121030302	FVOCI權益工具評價調整-普通股-上櫃                 
            121039901	FVOCI權益工具評價調整-其他                                
        - 結構型商品E
        - 證券化商品F    
        - 其它投資部位G
        - 央行可轉讓定期存單H
            121130911	FVOCI債務工具評價調整-央行NCD                     
            325350911	FVOCI債務備抵損失-央行NCD                         

121010301	FVOCI權益工具-普通股-上市公司                     
121010302	FVOCI權益工具-普通股-上櫃公司                     
121019901	FVOCI權益工具-其他                                
121110101	FVOCI債務工具-公債-中央政府(我國)                 
121110103	FVOCI債務工具-公債-地方政府(我國)                 
121110121	FVOCI債務工具-普通公司債（公營）                  
121110123	FVOCI債務工具-普通公司債（民營）                  
121110911	FVOCI債務工具-央行NCD                             
121030301	FVOCI權益工具評價調整-普通股-上市                 
121030302	FVOCI權益工具評價調整-普通股-上櫃                 
121039901	FVOCI權益工具評價調整-其他                        
121130101	FVOCI債務工具評價調整-公債-中央政府               
121130103	FVOCI債務工具評價調整-公債-地方政府               
121130121	FVOCI債務工具評價調整-普通公司債（公營)           
121130123	FVOCI債務工具評價調整-普通公司債（民營)           
121130911	FVOCI債務工具評價調整-央行NCD                     
325350103	FVOCI債務備抵損失-公債-地方政府(我國)             
325350121	FVOCI債務備抵損失-普通公司債(公營)                
325350123	FVOCI債務備抵損失-普通公司債(民營)                
325350911	FVOCI債務備抵損失-央行NCD                         

	
- 按攤銷後成本衡量A7
    - 投資成本
        - 政府公債A
            122010101	AC債務工具投資-公債-中央政府(我國)                
            122010103	AC債務工具投資-公債-地方政府(我國)                                
        - 公司債B
            122010121	AC債務工具投資-普通公司債(公營)                   
            122010123	AC債務工具投資-普通公司債(民營)                                
        - 金融債券C
        - 權益證券投資D
        - 結構型商品E
        - 證券化商品F
        - 其它投資部位G
        - 央行可轉讓定期存單H        
            122010911	AC債務工具投資-央行NCD        
	- 帳面價值
        - 政府公債A
            122030101	累積減損-AC債務工具投資-公債-中央                 
            122030103	累積減損-AC債務工具投資-公債-地方                         
        - 公司債B
            122030121	累積減損-累積減損-AC債務工具投資-普通公司(公營)   
            122030123	累積減損-AC債務工具投資-普通公司(民營)            
        - 金融債券C
        - 權益證券投資D
        - 結構型商品E
        - 證券化商品F    
        - 其它投資部位G
        - 央行可轉讓定期存單H
            122030911	累積減損-AC債務工具投資-央行NCD                   



122010101	AC債務工具投資-公債-中央政府(我國)                
122010103	AC債務工具投資-公債-地方政府(我國)                
122010121	AC債務工具投資-普通公司債(公營)                   
122010123	AC債務工具投資-普通公司債(民營)                   
122010911	AC債務工具投資-央行NCD                            
122030101	累積減損-AC債務工具投資-公債-中央                 
122030103	累積減損-AC債務工具投資-公債-地方                 
122030121	累積減損-累積減損-AC債務工具投資-普通公司(公營)   
122030123	累積減損-AC債務工具投資-普通公司(民營)            
122030911	累積減損-AC債務工具投資-央行NCD                   


其他A4_不動產投資	投資成本								1598217040
	帳面價值								1656354344




	情境一：利率上升0.5個百分點			
3100	本期損益	=-28700*50/1000		
3200	其他綜合損益		=-196700*50/1000	
3500	潛在評估損益			=-2062318*50/1000


數字哪邊來的這要問
